results/4-loadtest/azure_results/azure_dotnet_200.txt
Running 1m test @ https://dotnet-matrix-linux-310-westeurope.azurewebsites.net/api/matrix
  2 threads and 200 connections
  Thread calibration: mean lat.: 1199.060ms, rate sampling interval: 3694ms
  Thread calibration: mean lat.: 961.213ms, rate sampling interval: 3067ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   783.38ms  389.29ms   4.58s    86.43%
    Req/Sec   101.10      7.58   122.00     79.31%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  720.38ms
 75.000%  825.34ms
 90.000%    1.08s 
 99.000%    2.46s 
 99.900%    3.77s 
 99.990%    4.46s 
 99.999%    4.58s 
100.000%    4.58s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     108.287     0.000000            1         1.00
     467.455     0.100000         1009         1.11
     560.127     0.200000         2017         1.25
     627.199     0.300000         3036         1.43
     677.375     0.400000         4043         1.67
     720.383     0.500000         5057         2.00
     739.327     0.550000         5554         2.22
     756.735     0.600000         6051         2.50
     777.215     0.650000         6558         2.86
     799.743     0.700000         7064         3.33
     825.343     0.750000         7567         4.00
     844.287     0.775000         7819         4.44
     867.327     0.800000         8069         5.00
     900.095     0.825000         8325         5.71
     939.519     0.850000         8573         6.67
     983.551     0.875000         8825         8.00
    1017.343     0.887500         8953         8.89
    1077.247     0.900000         9077        10.00
    1171.455     0.912500         9203        11.43
    1304.575     0.925000         9330        13.33
    1394.687     0.937500         9455        16.00
    1442.815     0.943750         9518        17.78
    1502.207     0.950000         9582        20.00
    1582.079     0.956250         9644        22.86
    1699.839     0.962500         9707        26.67
    1839.103     0.968750         9771        32.00
    1879.039     0.971875         9802        35.56
    1908.735     0.975000         9833        40.00
    2016.255     0.978125         9865        45.71
    2113.535     0.981250         9896        53.33
    2209.791     0.984375         9928        64.00
    2287.615     0.985938         9944        71.11
    2361.343     0.987500         9960        80.00
    2433.023     0.989062         9975        91.43
    2512.895     0.990625         9991       106.67
    2680.831     0.992188        10007       128.00
    2734.079     0.992969        10015       142.22
    2787.327     0.993750        10022       160.00
    2838.527     0.994531        10030       182.86
    2922.495     0.995313        10038       213.33
    2977.791     0.996094        10046       256.00
    3055.615     0.996484        10050       284.44
    3186.687     0.996875        10054       320.00
    3368.959     0.997266        10058       365.71
    3436.543     0.997656        10062       426.67
    3512.319     0.998047        10066       512.00
    3577.855     0.998242        10068       568.89
    3592.191     0.998437        10070       640.00
    3672.063     0.998633        10072       731.43
    3688.447     0.998828        10074       853.33
    3772.415     0.999023        10076      1024.00
    3891.199     0.999121        10077      1137.78
    3899.391     0.999219        10078      1280.00
    3989.503     0.999316        10079      1462.86
    4030.463     0.999414        10080      1706.67
    4059.135     0.999512        10081      2048.00
    4059.135     0.999561        10081      2275.56
    4061.183     0.999609        10082      2560.00
    4061.183     0.999658        10082      2925.71
    4132.863     0.999707        10083      3413.33
    4132.863     0.999756        10083      4096.00
    4132.863     0.999780        10083      4551.11
    4460.543     0.999805        10084      5120.00
    4460.543     0.999829        10084      5851.43
    4460.543     0.999854        10084      6826.67
    4460.543     0.999878        10084      8192.00
    4460.543     0.999890        10084      9102.22
    4583.423     0.999902        10085     10240.00
    4583.423     1.000000        10085          inf
#[Mean    =      783.379, StdDeviation   =      389.286]
#[Max     =     4579.328, Total count    =        10085]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11802 requests in 1.00m, 3.25MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:    195.83
Transfer/sec:     55.24KB