results/4-loadtest/azure_results/azure_node_100.txt
Running 1m test @ https://node-matrix-linux-167-westeurope.azurewebsites.net/api/matrix
  2 threads and 100 connections
  Thread calibration: mean lat.: 636.062ms, rate sampling interval: 1652ms
  Thread calibration: mean lat.: 686.661ms, rate sampling interval: 1732ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   640.41ms  283.24ms   2.97s    82.36%
    Req/Sec    49.93      7.69    63.00     70.69%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  613.89ms
 75.000%  731.14ms
 90.000%  873.47ms
 99.000%    1.85s 
 99.900%    2.66s 
 99.990%    2.97s 
 99.999%    2.97s 
100.000%    2.97s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     102.271     0.000000            1         1.00
     346.367     0.100000          500         1.11
     485.887     0.200000         1000         1.25
     534.015     0.300000         1499         1.43
     576.511     0.400000         1999         1.67
     613.887     0.500000         2502         2.00
     632.831     0.550000         2750         2.22
     654.847     0.600000         3008         2.50
     675.327     0.650000         3247         2.86
     701.951     0.700000         3500         3.33
     731.135     0.750000         3748         4.00
     745.471     0.775000         3873         4.44
     764.415     0.800000         3997         5.00
     785.919     0.825000         4122         5.71
     811.007     0.850000         4249         6.67
     839.167     0.875000         4372         8.00
     855.551     0.887500         4434         8.89
     873.471     0.900000         4497        10.00
     895.999     0.912500         4559        11.43
     920.063     0.925000         4621        13.33
     948.735     0.937500         4684        16.00
     968.191     0.943750         4715        17.78
     997.375     0.950000         4747        20.00
    1020.927     0.956250         4777        22.86
    1107.967     0.962500         4808        26.67
    1254.399     0.968750         4839        32.00
    1314.815     0.971875         4855        35.56
    1379.327     0.975000         4871        40.00
    1473.535     0.978125         4886        45.71
    1556.479     0.981250         4902        53.33
    1611.775     0.984375         4917        64.00
    1654.783     0.985938         4925        71.11
    1716.223     0.987500         4933        80.00
    1816.575     0.989062         4941        91.43
    1893.375     0.990625         4949       106.67
    1974.271     0.992188         4956       128.00
    1997.823     0.992969         4960       142.22
    2060.287     0.993750         4964       160.00
    2240.511     0.994531         4968       182.86
    2353.151     0.995313         4972       213.33
    2408.447     0.996094         4976       256.00
    2459.647     0.996484         4978       284.44
    2478.079     0.996875         4980       320.00
    2525.183     0.997266         4982       365.71
    2562.047     0.997656         4984       426.67
    2594.815     0.998047         4986       512.00
    2603.007     0.998242         4987       568.89
    2613.247     0.998437         4988       640.00
    2631.679     0.998633         4989       731.43
    2658.303     0.998828         4990       853.33
    2689.023     0.999023         4991      1024.00
    2689.023     0.999121         4991      1137.78
    2744.319     0.999219         4992      1280.00
    2744.319     0.999316         4992      1462.86
    2793.471     0.999414         4993      1706.67
    2793.471     0.999512         4993      2048.00
    2793.471     0.999561         4993      2275.56
    2809.855     0.999609         4994      2560.00
    2809.855     0.999658         4994      2925.71
    2809.855     0.999707         4994      3413.33
    2809.855     0.999756         4994      4096.00
    2809.855     0.999780         4994      4551.11
    2969.599     0.999805         4995      5120.00
    2969.599     1.000000         4995          inf
#[Mean    =      640.410, StdDeviation   =      283.243]
#[Max     =     2967.552, Total count    =         4995]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5902 requests in 1.00m, 1.49MB read
  Socket errors: connect 0, read 0, write 0, timeout 26
Requests/sec:     98.05
Transfer/sec:     25.37KB