results/4-loadtest/azure_results/azure_python_25.txt
Running 1m test @ https://python-matrix-linux-679-westeurope.azurewebsites.net/api/matrix
  2 threads and 25 connections
  Thread calibration: mean lat.: 2999.875ms, rate sampling interval: 10584ms
  Thread calibration: mean lat.: 3574.241ms, rate sampling interval: 11476ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.44s     7.01s   33.44s    60.65%
    Req/Sec     5.75      0.66     7.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.91s 
 75.000%   25.23s 
 90.000%   28.61s 
 99.000%   31.31s 
 99.900%   32.93s 
 99.990%   33.46s 
 99.999%   33.46s 
100.000%   33.46s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4820.991     0.000000            1         1.00
    9281.535     0.100000           65         1.11
   12509.183     0.200000          132         1.25
   15294.463     0.300000          195         1.43
   17465.343     0.400000          260         1.67
   19906.559     0.500000          324         2.00
   21053.439     0.550000          358         2.22
   22249.471     0.600000          389         2.50
   23396.351     0.650000          422         2.86
   24346.623     0.700000          454         3.33
   25231.359     0.750000          486         4.00
   25821.183     0.775000          503         4.44
   26329.087     0.800000          519         5.00
   26886.143     0.825000          535         5.71
   27361.279     0.850000          551         6.67
   28049.407     0.875000          569         8.00
   28360.703     0.887500          576         8.89
   28622.847     0.900000          584        10.00
   28983.295     0.912500          592        11.43
   29114.367     0.925000          600        13.33
   29376.511     0.937500          608        16.00
   29491.199     0.943750          612        17.78
   29655.039     0.950000          617        20.00
   29851.647     0.956250          620        22.86
   29999.103     0.962500          624        26.67
   30212.095     0.968750          629        32.00
   30375.935     0.971875          630        35.56
   30425.087     0.975000          632        40.00
   30523.391     0.978125          634        45.71
   30605.311     0.981250          636        53.33
   30785.535     0.984375          639        64.00
   30785.535     0.985938          639        71.11
   31064.063     0.987500          640        80.00
   31227.903     0.989062          641        91.43
   31309.823     0.990625          642       106.67
   31375.359     0.992188          643       128.00
   31522.815     0.992969          644       142.22
   31522.815     0.993750          644       160.00
   31916.031     0.994531          645       182.86
   31916.031     0.995313          645       213.33
   32161.791     0.996094          646       256.00
   32161.791     0.996484          646       284.44
   32161.791     0.996875          646       320.00
   32931.839     0.997266          647       365.71
   32931.839     0.997656          647       426.67
   32931.839     0.998047          647       512.00
   32931.839     0.998242          647       568.89
   32931.839     0.998437          647       640.00
   33456.127     0.998633          648       731.43
   33456.127     1.000000          648          inf
#[Mean    =    19443.712, StdDeviation   =     7011.843]
#[Max     =    33439.744, Total count    =          648]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  741 requests in 1.00m, 184.67KB read
  Socket errors: connect 0, read 0, write 0, timeout 78
Requests/sec:     12.32
Transfer/sec:      3.07KB